Revit 2026 API

# TopographySurfaceIsValidRegion Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidRegion(
	IList<XYZ> points
)
```
```vb
Public Shared Function IsValidRegion (
	points As IList(Of XYZ)
) As Boolean
```
```cpp
public:
static bool IsValidRegion(
	IList<XYZ^>^ points
)
```
```fsharp
static member IsValidRegion :
        points : IList<XYZ> -> bool
```

#### Parameters

points IListXYZ

#### Return Value

Boolean

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace